In [1]:
import pandas as pd

In [2]:
hw_data=pd.read_csv("Height_Weight_org.csv")

In [3]:
hw_data

         Height    Weight
0      65.78331  112.9925
1      71.51521  136.4873
2      69.39874  153.0269
3      68.21660  142.3354
4      67.78781  144.2971
...         ...       ...
24995  69.50215  118.0312
24996  64.54826  120.1932
24997  64.69855  118.2655
24998  67.52918  132.2682
24999  68.87761  124.8742

[25000 rows x 2 columns]

In [4]:
hw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000 entries, 0 to 24999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Height  25000 non-null  float64
 1   Weight  25000 non-null  float64
dtypes: float64(2)
memory usage: 390.8 KB

In [6]:
height=hw_data[["Height"]]

In [11]:
std = height.std()
std

Height    1.901679
dtype: float64

In [12]:
mean = height.mean()
mean

Height    67.993114
dtype: float64

In [15]:
nan_hw_data = pd.read_csv("Height_Weight_NaN.csv")
nan_hw_data

         Height    Weight
0      65.78331  112.9925
1      71.51521       NaN
2      69.39874  153.0269
3      68.21660  142.3354
4           NaN  144.2971
...         ...       ...
24995  69.50215  118.0312
24996  64.54826  120.1932
24997  64.69855  118.2655
24998  67.52918  132.2682
24999  68.87761  124.8742

[25000 rows x 2 columns]

In [17]:
nan_hw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000 entries, 0 to 24999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Height  24891 non-null  float64
 1   Weight  24858 non-null  float64
dtypes: float64(2)
memory usage: 390.8 KB

In [22]:
medfill_hw_data = nan_hw_data.fillna(nan_hw_data.median())

In [24]:
ffill_hw_data = nan_hw_data.fillna(nan_hw_data.ffill())

In [40]:
nan_boston_housing = pd.read_csv("Boston_Housing_NaN.csv")
nan_boston_housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          20640 non-null  int64
 1   longitude           20640 non-null  float64
 2   latitude            20640 non-null  float64
 3   housing_median_age  20610 non-null  float64
 4   total_rooms         20610 non-null  float64
 5   total_bedrooms      20400 non-null  float64
 6   population          20613 non-null  float64
 7   households          20613 non-null  float64
 8   median_income       20613 non-null  float64
 9   median_house_value  20609 non-null  float64
 10  ocean_proximity     20640 non-null  object
dtypes: float64(9), int64(1), object(1)
memory usage: 1.7+ MB

In [42]:
nandrop_boston_housing = nan_boston_housing.dropna()

In [43]:
nandrop_boston_housing.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20229 entries, 0 to 20639
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          20229 non-null  int64
 1   longitude           20229 non-null  float64
 2   latitude            20229 non-null  float64
 3   housing_median_age  20229 non-null  float64
 4   total_rooms         20229 non-null  float64
 5   total_bedrooms      20229 non-null  float64
 6   population          20229 non-null  float64
 7   households          20229 non-null  float64
 8   median_income       20229 non-null  float64
 9   median_house_value  20229 non-null  float64
 10  ocean_proximity     20229 non-null  object
dtypes: float64(9), int64(1), object(1)
memory usage: 1.9+ MB

In [51]:
df = pd.DataFrame({"A":[1,10,5,20, 5, 9.5, 25, -1,8,-5]})
df

      A
0   1.0
1  10.0
2   5.0
3  20.0
4   5.0
5   9.5
6  25.0
7  -1.0
8   8.0
9  -5.0

In [53]:
#normalize using min-max method
normalized_df=(df-df.min())/(df.max()-df.min())
normalized_df

          A
0  0.200000
1  0.500000
2  0.333333
3  0.833333
4  0.333333
5  0.483333
6  1.000000
7  0.133333
8  0.433333
9  0.000000

In [55]:
#Using mean normalization:

normalized_df=(df-df.mean())/df.std()
normalized_df

          A
0 -0.736668
1  0.245556
2 -0.300124
3  1.336916
4 -0.300124
5  0.190988
6  1.882596
7 -0.954940
8  0.027284
9 -1.391484

In [69]:
df = pd.DataFrame(pd.read_csv("redshift.csv"))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 713 entries, 0 to 712
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      713 non-null    float64
 1   X2      713 non-null    float64
 2   X3      713 non-null    float64
 3   X4      713 non-null    float64
 4   X5      713 non-null    float64
 5   X6      713 non-null    float64
 6   X7      713 non-null    float64
 7   Y       555 non-null    float64
dtypes: float64(8)
memory usage: 44.7 KB

In [70]:
df_drop = df.dropna()

In [71]:
df_drop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 555 entries, 0 to 712
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      555 non-null    float64
 1   X2      555 non-null    float64
 2   X3      555 non-null    float64
 3   X4      555 non-null    float64
 4   X5      555 non-null    float64
 5   X6      555 non-null    float64
 6   X7      555 non-null    float64
 7   Y       555 non-null    float64
dtypes: float64(8)
memory usage: 39.0 KB

In [72]:
df_drop.corr()

,X1,X2,X3,X4,X5,X6,X7,Y
X1,1.000000,0.216610,0.004192,-0.119559,-0.004411,0.017833,0.076049,-0.303717
X2,0.216610,1.000000,0.772018,0.197752,0.488519,0.439211,0.290729,-0.410371
X3,0.004192,0.772018,1.000000,0.449336,0.677782,0.539563,0.428894,0.011113
X4,-0.119559,0.197752,0.449336,1.000000,0.666722,0.457620,0.461471,0.646964
X5,-0.004411,0.488519,0.677782,0.666722,1.000000,0.541077,0.440585,0.316365
X6,0.017833,0.439211,0.539563,0.457620,0.541077,1.000000,0.097442,0.135819
X7,0.076049,0.290729,0.428894,0.461471,0.440585,0.097442,1.000000,0.177353
Y,-0.303717,-0.410371,0.011113,0.646964,0.316365,0.135819,0.177353,1.000000